uhnp/src/Catalogs/КлючиАналитикиПланированияНоменклатуры/КлючиАналитикиПланированияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиПланированияНоменклатуры</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.ЕдиницаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>Коэффициент пересчета из единицы измерения записи в базовую</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяНоменклатура</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АналитикаПланированияНоменклатуры/АналитикаПланированияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаПланированияНоменклатуры</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.ЕдиницаИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коэффициент</name>
    <comment>Коэффициент пересчета из единицы измерения записи в базовую</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходнаяНоменклатура</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КлючиАналитикиПланированияНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
    Поля.Добавить("Номенклатура");
    Поля.Добавить("Характеристика");
    Поля.Добавить("ЕдиницаИзмерения");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Данные.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если ЗначениеЗаполнено(Данные.Характеристика) Тогда
			ШаблонПредставления = НСтр("ru = '%1 (%2), %3'");
		Иначе
			ШаблонПредставления = НСтр("ru = '%1, %3'");
		КонецЕсли;
	Иначе
		ШаблонПредставления = НСтр("ru = '%1'");
	КонецЕсли;
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПредставления, 
		Данные.Номенклатура, Данные.Характеристика, Данные.ЕдиницаИзмерения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаменаДублейКлючейАналитики

Процедура ЗаменитьДублиКлючейАналитики() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	ДанныеСправочника.ПометкаУдаления КАК ПометкаУдаления,
	|	Аналитика.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	Справочник.КлючиАналитикиПланированияНоменклатуры КАК ДанныеСправочника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияНоменклатуры КАК ДанныеРегистра
	|		ПО ДанныеСправочника.Ссылка = ДанныеРегистра.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияНоменклатуры КАК Аналитика
	|		ПО ДанныеСправочника.Номенклатура = Аналитика.Номенклатура
	|			И ДанныеСправочника.Характеристика = Аналитика.Характеристика
	|			И ДанныеСправочника.ЕдиницаИзмерения = Аналитика.ЕдиницаИзмерения
	|			И ДанныеСправочника.Коэффициент = Аналитика.Коэффициент
	|			И ДанныеСправочника.ИсходнаяНоменклатура = Аналитика.ИсходнаяНоменклатура
	|ГДЕ
	|	ДанныеРегистра.КлючАналитики ЕСТЬ NULL";
	
	// Сформируем соответствие ключей аналитики.
	СоответствиеАналитик = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СоответствиеАналитик.Вставить(Выборка.Ссылка, Выборка.КлючАналитики);
			
			Если Не Выборка.ПометкаУдаления Тогда
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Попытка
					СправочникОбъект.УстановитьПометкуУдаления(Истина, Ложь);
				Исключение
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;

		КонецЦикла;
		ОбщегоНазначенияОПК.ЗаменитьСсылки(СоответствиеАналитик);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
